Splash-OpenFOAM/Resources/Template_Cases/splashThings/0/p
/*--------------------------------*- C++ -*----------------------------------*\
-------------------------------------------------------------------------------
  ***    *     *  ******   *******  ******    *****     ***    *     *  ******   
 *   *   **   **  *     *  *        *     *  *     *   *   *   **    *  *     *  
*     *  * * * *  *     *  *        *     *  *        *     *  * *   *  *     *  
*******  *  *  *  ******   ****     ******    *****   *******  *  *  *  *     *  
*     *  *     *  *        *        *   *          *  *     *  *   * *  *     *  
*     *  *     *  *        *        *    *   *     *  *     *  *    **  *     *  
*     *  *     *  *        *******  *     *   *****   *     *  *     *  ******   
-------------------------------------------------------------------------------

This file is part of OpenFOAM casefiles automatically generated by AmpersandCFD*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0;

boundaryField 
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type zeroGradient;
        value uniform 0;
    }
    
    outlet
    {
        type fixedValue;
        value uniform 0;
    }
    
    front
    {
        type symmetry;
    }
    
    back
    {
        type symmetry;
    }
    
    bottom
    {
        type symmetry;
    }
    
    top
    {
        type symmetry;
    }
    
   "geom.*"
    {
        type zeroGradient;
        value uniform 0;
    }
    
}